duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_RES_TEST/src/screen/screen.c
void IdleShowSystemDate(void)
{
	uint16_t x,y,w,h,str_w,str_h;;
	uint8_t str_date[20] = {0};
	uint16_t str_mon[12] = {
								STR_ID_MONTH_JAN,
								STR_ID_MONTH_FEB,
								STR_ID_MONTH_MAR,
								STR_ID_MONTH_APR,
								STR_ID_MONTH_MAY,
								STR_ID_MONTH_JUN,
								STR_ID_MONTH_JUL,
								STR_ID_MONTH_AUG,
								STR_ID_MONTH_SEPT,
								STR_ID_MONTH_OCT,
								STR_ID_MONTH_NOV,
								STR_ID_MONTH_DEC,
							};

	uint16_t str_mon_cn[2] = {0x6708,0x0000};
	uint16_t str_day_cn[2] = {0x65E5,0x0000};
	uint16_t str_mon_kr[2] = {0xC6D4,0x0000};//?
	uint16_t str_day_kr[2] = {0xC77C,0x0000};//?
	uint16_t *str_m,*str_d;
	uint32_t img_24_num[10] = {IMG_ID_FONT_24_NUM_0,IMG_ID_FONT_24_NUM_1,IMG_ID_FONT_24_NUM_2,IMG_ID_FONT_24_NUM_3,IMG_ID_FONT_24_NUM_4,
							   IMG_ID_FONT_24_NUM_5,IMG_ID_FONT_24_NUM_6,IMG_ID_FONT_24_NUM_7,IMG_ID_FONT_24_NUM_8,IMG_ID_FONT_24_NUM_9};
	uint32_t img_20_num[10] = {IMG_ID_FONT_20_NUM_0,IMG_ID_FONT_20_NUM_1,IMG_ID_FONT_20_NUM_2,IMG_ID_FONT_20_NUM_3,IMG_ID_FONT_20_NUM_4,
							   IMG_ID_FONT_20_NUM_5,IMG_ID_FONT_20_NUM_6,IMG_ID_FONT_20_NUM_7,IMG_ID_FONT_20_NUM_8,IMG_ID_FONT_20_NUM_9};

	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;
	LCD_SetFontSize(FONT_SIZE_28);

	switch(global_settings.language)
	{
 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)||defined(LANGUAGE_KR_ENABLE)
   #ifdef LANGUAGE_CN_ENABLE
	case LANGUAGE_CN:
   #endif
   #ifdef LANGUAGE_JA_ENABLE
	case LANGUAGE_JA:
   #endif
   #ifdef LANGUAGE_KR_ENABLE
	case LANGUAGE_KR:
   #endif
		switch(global_settings.language)
		{
	   #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
		case LANGUAGE_CN:
	   #endif
	   #ifdef LANGUAGE_JA_ENABLE
		case LANGUAGE_JA:
	   #endif
			x = IDLE_DATE_MON_CN_X;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_cn;
			str_d = str_day_cn;
			break;
	   #endif
	   	   
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
			x = IDLE_DATE_MON_CN_X-10;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W+10;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_kr;
			str_d = str_day_kr;
			break;
	   #endif
		}

		LCD_FillColor(x, y, w, h, BLACK);
		if(date_time.month > 9)
		{
			LCD_ShowImage(x, y+2, img_20_num[date_time.month/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImage(x, y+2, img_20_num[date_time.month%10]);

		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_m);
		LCD_MeasureUniString(str_m, &w, &h);
		
		x += w;
		if(date_time.day > 9)
		{
			LCD_ShowImage(x, y+2, img_20_num[date_time.day/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImage(x, y+2, img_20_num[date_time.day%10]);
		
		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_d);
		break;
 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JA_ENABLE||LANGUAGE_KR_ENABLE*/		
	
	default:
		x = IDLE_DATE_DAY_EN_X;
		LCD_ShowImage(x+0*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y, img_20_num[date_time.day/10]);
		LCD_ShowImage(x+1*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y, img_20_num[date_time.day%10]);

		LCD_MeasureUniStr(str_mon[date_time.month-1], &str_w, &str_h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
		{
			switch(global_settings.language)
			{
		   #ifdef LANGUAGE_AR_ENABLE
			case LANGUAGE_AR:
				x = IDLE_WEEK_EN_X;
				y = IDLE_WEEK_EN_Y;
				w = IDLE_DATE_MON_EN_W;
				h = IDLE_DATE_MON_EN_H;
				break;
		   #endif
		   
			default:
				x = IDLE_DATE_MON_EN_X;
				y = IDLE_DATE_MON_EN_Y;
				w = IDLE_DATE_MON_EN_W;
				h = IDLE_DATE_MON_EN_H;
				break;
			}
			LCD_FillColor(x, y, w, h, BLACK);
			
			if(w > str_w)
				LCD_ShowUniStrRtoL(x+(w+str_w)/2, y, str_mon[date_time.month-1]);
			else
				LCD_ShowUniStrRtoL(x+w, y, str_mon[date_time.month-1]);
		}
		else
	#endif		
		{
			LCD_FillColor(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, IDLE_DATE_MON_EN_W, IDLE_DATE_MON_EN_H, BLACK);
			
			if(IDLE_DATE_MON_EN_W > str_w)
				LCD_ShowUniStr(IDLE_DATE_MON_EN_X+(IDLE_DATE_MON_EN_W-str_w)/2, IDLE_DATE_MON_EN_Y, str_mon[date_time.month-1]);
			else
				LCD_ShowUniStr(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, str_mon[date_time.month-1]);
		}
		break;
	}
}

void IdleShowSystemTime(void)
{
	uint8_t dis_hour;
	uint16_t str_w,str_h;
	static bool flag = false;
	uint32_t img_num[10] = {IMG_ID_FONT_53_NUM_0,IMG_ID_FONT_53_NUM_1,IMG_ID_FONT_53_NUM_2,IMG_ID_FONT_53_NUM_3,IMG_ID_FONT_53_NUM_4,
							IMG_ID_FONT_53_NUM_5,IMG_ID_FONT_53_NUM_6,IMG_ID_FONT_53_NUM_7,IMG_ID_FONT_53_NUM_8,IMG_ID_FONT_53_NUM_9};

	flag = !flag;

	dis_hour = date_time.hour;
	if(global_settings.time_format == TIME_FORMAT_12)
	{
		if(date_time.hour > 12)
			dis_hour = date_time.hour-12;
		else if(date_time.hour == 0)
			dis_hour = date_time.hour+12;
	}
	

	LCD_ShowImage(IDLE_TIME_X+0*IDLE_TIME_NUM_W, IDLE_TIME_Y, img_num[dis_hour/10]);
	LCD_ShowImage(IDLE_TIME_X+1*IDLE_TIME_NUM_W, IDLE_TIME_Y, img_num[dis_hour%10]);
	
	if(flag)
		LCD_ShowImage(IDLE_TIME_X+2*IDLE_TIME_NUM_W, IDLE_TIME_Y, IMG_ID_FONT_53_COLON);
	else
		LCD_Fill(IDLE_TIME_X+2*IDLE_TIME_NUM_W, IDLE_TIME_Y, IDLE_TIME_COLON_W, IDLE_TIME_COLON_H, BLACK);
	
	LCD_ShowImage(IDLE_TIME_X+2*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y, img_num[date_time.minute/10]);
	LCD_ShowImage(IDLE_TIME_X+3*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y, img_num[date_time.minute%10]);
	if(global_settings.time_format == TIME_FORMAT_12)
	{
		LCD_SetFontSize(FONT_SIZE_28);
		LCD_MeasureUniStr(STR_ID_PM, &str_w, &str_h);
		
		if(date_time.hour >= 12)
			LCD_ShowUniStr(IDLE_TIME_X+4*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y+IDLE_TIME_NUM_H-str_h, STR_ID_PM);
		else
			LCD_ShowUniStr(IDLE_TIME_X+4*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y+IDLE_TIME_NUM_H-str_h, STR_ID_AM);
	}
}

void IdleShowSystemWeek(void)
{
	uint16_t x,y,w,h,str_w,str_h;
#ifdef FONTMAKER_UNICODE_FONT	
	uint16_t str_week[7] = {
								STR_ID_WEEK_SUN,
								STR_ID_WEEK_MON,
								STR_ID_WEEK_TUE,
								STR_ID_WEEK_WED,
								STR_ID_WEEK_THU,
								STR_ID_WEEK_FRI,
								STR_ID_WEEK_SAT,
							};
#else
	uint8_t str_week[128] = {0};
#endif
	
	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);

	switch(global_settings.language)
	{
   #ifdef LANGUAGE_CN_ENABLE
	case LANGUAGE_CN:
		x = IDLE_WEEK_CN_X;
		y = IDLE_WEEK_CN_Y;
		w = IDLE_WEEK_CN_W;
		h = IDLE_WEEK_CN_H;
		break;
   #endif
   
   #if defined(LANGUAGE_JA_ENABLE)||defined(LANGUAGE_KR_ENABLE)
   #ifdef LANGUAGE_JA_ENABLE
	case LANGUAGE_JA:
   #endif
   #ifdef LANGUAGE_KR_ENABLE
	case LANGUAGE_KR:
   #endif
		x = IDLE_WEEK_CN_X;
		y = IDLE_WEEK_CN_Y;
		w = IDLE_WEEK_CN_W;
		h = IDLE_WEEK_CN_H;
		break;
   #endif/*LANGUAGE_JA_ENABLE||LANGUAGE_KR_ENABLE*/
   
