duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_RES_TEST/src/screen/screen.c
}

void FallScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FALL].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATED;

		FallShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		FallUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
}

void EnterFallScreen(void)
{
	if(screen_id == SCREEN_ID_FALL)
		return;

	k_timer_stop(&notify_timer);
	k_timer_stop(&mainmenu_timer);

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif
#ifdef NB_SIGNAL_TEST
	if(gps_is_working())
		MenuStopGPS();
#endif	
#ifdef CONFIG_PPG_SUPPORT
	if(IsInPPGScreen()&&!PPGIsWorkingTiming())
		PPGStopCheck();
#endif
#ifdef CONFIG_TEMP_SUPPORT
	if(IsInTempScreen()&&!TempIsWorkingTiming())
		MenuStopTemp();
#endif
#ifdef CONFIG_SYNC_SUPPORT
	if(SyncIsRunning())
		SyncDataStop();
#endif

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_FALL;	
	scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATING;

	ClearAllKeyHandler();
}
#endif/*CONFIG_FALL_DETECT_SUPPORT*/

#ifdef CONFIG_SLEEP_SUPPORT
void SleepUpdateStatus(void)
{
	uint16_t total_sleep,deep_sleep,light_sleep;
	uint32_t img_big_num[10] = {IMG_ID_FONT_38_NUM_0,IMG_ID_FONT_38_NUM_1,IMG_ID_FONT_38_NUM_2,IMG_ID_FONT_38_NUM_3,IMG_ID_FONT_38_NUM_4,
								IMG_ID_FONT_38_NUM_5,IMG_ID_FONT_38_NUM_6,IMG_ID_FONT_38_NUM_7,IMG_ID_FONT_38_NUM_8,IMG_ID_FONT_38_NUM_9};
	uint32_t img_num[10] = {IMG_ID_FONT_24_NUM_0,IMG_ID_FONT_24_NUM_1,IMG_ID_FONT_24_NUM_2,IMG_ID_FONT_24_NUM_3,IMG_ID_FONT_24_NUM_4,
							IMG_ID_FONT_24_NUM_5,IMG_ID_FONT_24_NUM_6,IMG_ID_FONT_24_NUM_7,IMG_ID_FONT_24_NUM_8,IMG_ID_FONT_24_NUM_9};
				

	GetSleepTimeData(&deep_sleep, &light_sleep);
	total_sleep = deep_sleep+light_sleep;

	LCD_ShowImage(SLEEP_TOTAL_STR_HR_X+0*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_HR_Y, img_big_num[(total_sleep/60)/10]);
	LCD_ShowImage(SLEEP_TOTAL_STR_HR_X+1*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_HR_Y, img_big_num[(total_sleep/60)%10]);
	LCD_ShowImage(SLEEP_TOTAL_STR_MIN_X+0*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_MIN_Y, img_big_num[(total_sleep%60)/10]);
	LCD_ShowImage(SLEEP_TOTAL_STR_MIN_X+1*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_MIN_Y, img_big_num[(total_sleep%60)%10]);

	LCD_ShowImage(SLEEP_DEEP_STR_X+0*SLEEP_DEEP_NUM_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep/60)/10]);
	LCD_ShowImage(SLEEP_DEEP_STR_X+1*SLEEP_DEEP_NUM_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep/60)%10]);
	LCD_ShowImage(SLEEP_DEEP_STR_X+2*SLEEP_DEEP_NUM_W+SLEEP_DEEP_COLON_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep%60)/10]);
	LCD_ShowImage(SLEEP_DEEP_STR_X+3*SLEEP_DEEP_NUM_W+SLEEP_DEEP_COLON_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep%60)%10]);

	LCD_ShowImage(SLEEP_LIGHT_STR_X+0*SLEEP_LIGHT_NUM_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep/60)/10]);
	LCD_ShowImage(SLEEP_LIGHT_STR_X+1*SLEEP_LIGHT_NUM_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep/60)%10]);
	LCD_ShowImage(SLEEP_LIGHT_STR_X+2*SLEEP_LIGHT_NUM_W+SLEEP_LIGHT_COLON_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep%60)/10]);
	LCD_ShowImage(SLEEP_LIGHT_STR_X+3*SLEEP_LIGHT_NUM_W+SLEEP_LIGHT_COLON_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep%60)%10]);	
}

void SleepShowStatus(void)
{
	uint8_t strbuf[64] = {0};
	uint16_t total_sleep,deep_sleep,light_sleep;
	uint32_t img_big_num[10] = {IMG_ID_FONT_38_NUM_0,IMG_ID_FONT_38_NUM_1,IMG_ID_FONT_38_NUM_2,IMG_ID_FONT_38_NUM_3,IMG_ID_FONT_38_NUM_4,
								IMG_ID_FONT_38_NUM_5,IMG_ID_FONT_38_NUM_6,IMG_ID_FONT_38_NUM_7,IMG_ID_FONT_38_NUM_8,IMG_ID_FONT_38_NUM_9};
	uint32_t img_num[10] = {IMG_ID_FONT_24_NUM_0,IMG_ID_FONT_24_NUM_1,IMG_ID_FONT_24_NUM_2,IMG_ID_FONT_24_NUM_3,IMG_ID_FONT_24_NUM_4,
							IMG_ID_FONT_24_NUM_5,IMG_ID_FONT_24_NUM_6,IMG_ID_FONT_24_NUM_7,IMG_ID_FONT_24_NUM_8,IMG_ID_FONT_24_NUM_9};

	
	LCD_ShowImage(SLEEP_TOTAL_ICON_X, SLEEP_TOTAL_ICON_Y, IMG_ID_SLEEP_ICON);
	LCD_ShowImage(SLEEP_TOTAL_UNIT_H_X, SLEEP_TOTAL_UNIT_H_Y, IMG_ID_SLEEP_H);
	LCD_ShowImage(SLEEP_TOTAL_UNIT_M_X, SLEEP_TOTAL_UNIT_M_Y, IMG_ID_SLEEP_M);
	LCD_ShowImage(SLEEP_SEP_LINE_X, SLEEP_SEP_LINE_Y, IMG_ID_SLEEP_LINE);

	LCD_ShowImage(SLEEP_DEEP_ICON_X, SLEEP_DEEP_ICON_Y, IMG_ID_SLEEP_DEEP_ICON);
	LCD_ShowImage(SLEEP_LIGHT_ICON_X, SLEEP_LIGHT_ICON_Y, IMG_ID_SLEEP_LIGHT_ICON);

	GetSleepTimeData(&deep_sleep, &light_sleep);
	total_sleep = deep_sleep+light_sleep;

	LCD_ShowImage(SLEEP_TOTAL_STR_HR_X+0*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_HR_Y, img_big_num[(total_sleep/60)/10]);
	LCD_ShowImage(SLEEP_TOTAL_STR_HR_X+1*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_HR_Y, img_big_num[(total_sleep/60)%10]);
	LCD_ShowImage(SLEEP_TOTAL_STR_MIN_X+0*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_MIN_Y, img_big_num[(total_sleep%60)/10]);
	LCD_ShowImage(SLEEP_TOTAL_STR_MIN_X+1*SLEEP_TOTAL_NUM_W, SLEEP_TOTAL_STR_MIN_Y, img_big_num[(total_sleep%60)%10]);

	LCD_ShowImage(SLEEP_DEEP_STR_X+0*SLEEP_DEEP_NUM_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep/60)/10]);
	LCD_ShowImage(SLEEP_DEEP_STR_X+1*SLEEP_DEEP_NUM_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep/60)%10]);
	LCD_ShowImage(SLEEP_DEEP_STR_X+2*SLEEP_DEEP_NUM_W, SLEEP_DEEP_STR_Y, IMG_ID_FONT_24_COLON);
	LCD_ShowImage(SLEEP_DEEP_STR_X+2*SLEEP_DEEP_NUM_W+SLEEP_DEEP_COLON_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep%60)/10]);
	LCD_ShowImage(SLEEP_DEEP_STR_X+3*SLEEP_DEEP_NUM_W+SLEEP_DEEP_COLON_W, SLEEP_DEEP_STR_Y, img_num[(deep_sleep%60)%10]);

	LCD_ShowImage(SLEEP_LIGHT_STR_X+0*SLEEP_LIGHT_NUM_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep/60)/10]);
	LCD_ShowImage(SLEEP_LIGHT_STR_X+1*SLEEP_LIGHT_NUM_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep/60)%10]);
	LCD_ShowImage(SLEEP_LIGHT_STR_X+2*SLEEP_LIGHT_NUM_W, SLEEP_LIGHT_STR_Y, IMG_ID_FONT_24_COLON);
	LCD_ShowImage(SLEEP_LIGHT_STR_X+2*SLEEP_LIGHT_NUM_W+SLEEP_LIGHT_COLON_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep%60)/10]);
	LCD_ShowImage(SLEEP_LIGHT_STR_X+3*SLEEP_LIGHT_NUM_W+SLEEP_LIGHT_COLON_W, SLEEP_LIGHT_STR_Y, img_num[(light_sleep%60)%10]);
}

void SleepScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SLEEP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SLEEP].status = SCREEN_STATUS_CREATED;

		LCD_Clear(BLACK);
		IdleShowSignal();
		IdleShowNetMode();
		IdleShowBatSoc();
		SleepShowStatus();
		break;
		
